UTAF_Base/requestFiles/PFB_CFB_latest.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:v2="http://api.web.bc/api/schema/commoncontext/v2" xmlns:v1="http://api.web.bc/api/schema/commoncontext/transaction/v1" xmlns:v11="http://api.web.bc/api/schema/commoncontext/consumertransaction/v1" xmlns:v21="http://api.web.bc/capability/business/b280-01/services/checkfinancialbackground/flv000340/v2" xmlns:v22="http://api.web.bc/capability/business/b280-01/objects/requestcheckcreditworthiness/flv000340/v2">
   <soapenv:Header>
      <v2:CommonContextRequest>
         <v2:transaction>
            <v1:messageId>${Req_corrId}</v1:messageId>
            <v1:correlationId>${Req_corrId}</v1:correlationId>
            <v1:conversationId>1</v1:conversationId>
            <v1:sequenceNumber>1</v1:sequenceNumber>
            <v1:dateTimeCreated>${Req_datetime}</v1:dateTimeCreated>
         </v2:transaction>
         <v2:consumerTransaction>
            <v11:businessTransactionId>1</v11:businessTransactionId>
            <v11:dateTimeCreated>1</v11:dateTimeCreated>
         </v2:consumerTransaction> 
         </v2:CommonContextRequest>
   </soapenv:Header>
   <soapenv:Body>
      <v21:RequestDataCheckCreditWorthiness>
         <v21:serviceContext>
            <v21:scoping>
               <v22:codeSystem>${Req_scoping_codeSystem}</v22:codeSystem>
               
               <v22:value>${Req_scoping_value}</v22:value>
            </v21:scoping>
            <v21:transactionData>
               <v21:endUserId>ID999658</v21:endUserId>
               <v21:endUserLanguage>EN</v21:endUserLanguage>
               <v21:consumerApplication>PFB</v21:consumerApplication>
            </v21:transactionData>
         </v21:serviceContext>
         <v21:serviceData>
            <v21:criteria>
               <v21:customerIdentifier>
                  <v22:id>${Req_custId}</v22:id>
                  <v22:idScope>
                     <v22:value>${Req_custId_idScope}</v22:value>
                  </v22:idScope>
                  <v22:idContext>
                     <v22:value>${Req_custId_idContext}</v22:value>
                  </v22:idContext>
               </v21:customerIdentifier>
               <v21:identifier>
                  <v22:id>${Req_partyId}</v22:id>
                  <v22:idScope>
                     <v22:value>${Req_partyId_idScope}</v22:value>
                  </v22:idScope>
                  <v22:idContext>
                     <v22:value>${Req_partyId_idContext}</v22:value>
                  </v22:idContext>
               </v21:identifier>
               <v21:VATNumber>
                  <v22:countryCode>
                     <v22:alpha2Code>${Req_VAT_countryCode}</v22:alpha2Code>
                  </v22:countryCode>
                  <v22:VATNumber>${Req_VATNumber}</v22:VATNumber>
               </v21:VATNumber>
            </v21:criteria>
            <v21:digitalPartyIdentity>
               <v22:acceptanceStatus>
                  <v22:value>PXS_MANUAL_VALIDATION</v22:value>
               </v22:acceptanceStatus>
            </v21:digitalPartyIdentity> 
         </v21:serviceData>
      </v21:RequestDataCheckCreditWorthiness>
   </soapenv:Body>
</soapenv:Envelope>